WindTunnelGUI/runs/Run_1_20260122_134237/windTunnelCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime 0.1;

deltaT 1e-05;

writeControl timeStep;

writeInterval 50.0;

adjustTimeStep yes;
maxCo 0.5;
maxDeltaT 0.0001;
purgeWrite 0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        enabled         false;
        writeControl timeStep;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
    
    forces1
    {
        type            forces;
        libs            (forces);
        enabled         false;
        writeControl timeStep;
        writeInterval 50.0;
        patches         (model);
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0 0 0);
    }
}

// ************************************************************************* //
