WindTunnelGUI/runs/Run_1_20260122_134237/windTunnelCase/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

// epsilon = Cmu^0.75 * k^1.5 / l, with l ~ 0.1 * hydraulic diameter
internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    model
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    ".*"
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
